org/roam/android.org
:PROPERTIES:
:ID:       8005808d-1b21-48df-9706-6b999ee9aff6
:END:
#+title: android
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* android
** notes
- automobile integration
   - Ford https://github.com/smartdevicelink/sdl_java_suite
   - android auto
- developer mode by tapping build number in settings multiple times
- custom rom cyanogenmod discontinued into LineageOS
- pkvm hypervisor
  - boots GKI linux kernel which loads the vendors modules
  - Runs a pVM or stripped down microdroid (no java api)
    - communicates over binder vsock (no virtio-gpu yet)
- GrapheneOS
  - patches add memory protections
  - app store for camera, pdf, other app store, etc.
- ART JIT
  - AOT compile and JIT
  - CC gc has constant time regardless of heap
- Pixel 9+ include gemini-nano by default through the AICore service
** apps
*** termux
- vol up/down and a/d to move left/right (other shortcuts too)
- vol up long and Q for special keyboard
**** x11
install nightly x11-termux apk open in background:
pkg install x11-repo
pkg install termux-x11-nightly
pkg install virglrenderer-android
pkg install xfce

virgl_test_server_android &
termux-x11 :0 -xstartup "dbus-launch --exit-with-session xfce4-session"

*** aurora store
- google play store without google account
*** fdroid
- apk repo that can self host and share device to device
- emacs, hackers keyboard, organic maps, i2p, wireguard, vlc
*** accrescent app store
