android.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>android</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org30c675f">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org74a72b4" class="outline-2">
<h2 id="org74a72b4">android</h2>
<div class="outline-text-2" id="text-org74a72b4">
</div>
<div id="outline-container-org33bd283" class="outline-3">
<h3 id="org33bd283">notes</h3>
<div class="outline-text-3" id="text-org33bd283">
<ul class="org-ul">
<li>automobile integration
<ul class="org-ul">
<li>Ford <a href="https://github.com/smartdevicelink/sdl_java_suite">https://github.com/smartdevicelink/sdl_java_suite</a></li>
<li>android auto</li>
</ul></li>
<li>developer mode by tapping build number in settings multiple times</li>
<li>custom rom cyanogenmod discontinued into LineageOS</li>
<li>pkvm hypervisor
<ul class="org-ul">
<li>boots GKI linux kernel which loads the vendors modules</li>
<li>Runs a pVM or stripped down microdroid (no java api)
<ul class="org-ul">
<li>communicates over binder vsock (no virtio-gpu yet)</li>
</ul></li>
</ul></li>
<li>GrapheneOS
<ul class="org-ul">
<li>patches add memory protections</li>
<li>app store for camera, pdf, other app store, etc.</li>
</ul></li>
<li>ART JIT
<ul class="org-ul">
<li>AOT compile and JIT</li>
<li>CC gc has constant time regardless of heap</li>
</ul></li>
<li>Pixel 9+ include gemini-nano by default through the AICore service</li>
</ul>
</div>
</div>
<div id="outline-container-org6c4493f" class="outline-3">
<h3 id="org6c4493f">apps</h3>
<div class="outline-text-3" id="text-org6c4493f">
</div>
<div id="outline-container-org5153187" class="outline-4">
<h4 id="org5153187">termux</h4>
<div class="outline-text-4" id="text-org5153187">
<ul class="org-ul">
<li>vol up/down and a/d to move left/right (other shortcuts too)</li>
<li>vol up long and Q for special keyboard</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org1e995d1"></a>x11<br>
<div class="outline-text-5" id="text-org1e995d1">
<p>
install nightly x11-termux apk open in background:
pkg install x11-repo
pkg install termux-x11-nightly
pkg install virglrenderer-android
pkg install xfce
</p>

<p>
virgl<sub>test</sub><sub>server</sub><sub>android</sub> &amp;
termux-x11 :0 -xstartup "dbus-launch &#x2013;exit-with-session xfce4-session"
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org7f1537c" class="outline-4">
<h4 id="org7f1537c">aurora store</h4>
<div class="outline-text-4" id="text-org7f1537c">
<ul class="org-ul">
<li>google play store without google account</li>
</ul>
</div>
</div>
<div id="outline-container-org19d7fb3" class="outline-4">
<h4 id="org19d7fb3">fdroid</h4>
<div class="outline-text-4" id="text-org19d7fb3">
<ul class="org-ul">
<li>apk repo that can self host and share device to device</li>
<li>emacs, hackers keyboard, organic maps, i2p, wireguard, vlc</li>
</ul>
</div>
</div>
<div id="outline-container-orgd6f0919" class="outline-4">
<h4 id="orgd6f0919">accrescent app store</h4>
</div>
</div>
</div>
</div>
</body>
</html>
